## Linear Regression with multiple variables

In [1]:
import numpy as np
import pandas as pd
# from matplotlib import pyplot as plt
from sklearn import linear_model

In [2]:
df = pd.read_csv('homeprices.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [5]:
median_bedrooms = df.bedrooms.median()
median_bedrooms

4.0

## Fill the NA values with meadian

In [7]:
df.bedrooms = df.bedrooms.fillna(median_bedrooms)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

## Define and Train the model

In [8]:
reg = linear_model.LinearRegression()
reg.fit(df[['area','bedrooms','age']],df.price)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [10]:
reg.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [11]:
reg.intercept_

221323.00186540408

## Find Price of home with area 3000, bedrooms 3 and age 40

In [16]:
reg.predict(np.array([3000,3,40]).reshape(1,3))

array([498408.25158031])

In [18]:
3000*112.06244194+3*23388.88007794-3231.71790863*40 +221323.00186540408

498408.2515740241

## Find Price of home with area 2500, bedrooms 4 and age 5

In [19]:
reg.predict(np.array([2500,4,5]).reshape(1,3))

array([578876.03748933])